; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	thermograph3 - mode
	spectrograph1 - mode
	image2 - mode
	Star3 - direction
	Star7 - direction
	Star9 - direction
	GroundStation8 - direction
	Star11 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	Star6 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Star1 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation10)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph3)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Star12 thermograph0)
	(have_image Planet13 thermograph0)
	(have_image Star14 thermograph0)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 image2)
	(have_image Planet17 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet13)
   goals met: 0 of 7
5. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 7
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 7
8. (calibrate satellite1 instrument3 star6)
   added: (calibrated instrument3)
   goals met: 1 of 7
9. (take_image satellite0 phenomenon16 instrument0 image2)
   added: (have_image phenomenon16 image2)
   goals met: 2 of 7
10. (turn_to satellite0 planet15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet15)
   goals met: 2 of 7
11. (take_image satellite0 planet15 instrument0 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 3 of 7
12. (turn_to satellite0 star12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star12)
   goals met: 3 of 7
13. (take_image satellite0 star12 instrument0 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 4 of 7
14. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 4 of 7
15. (take_image satellite0 star14 instrument0 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 5 of 7
16. (turn_to satellite0 star5 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star5)
   goals met: 6 of 7
17. (turn_to satellite1 planet17 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet17)
   goals met: 6 of 7
18. (take_image satellite1 planet17 instrument3 spectrograph1)
   added: (have_image planet17 spectrograph1)
   goals met: 7 of 7
